export default function MainObjective() {
  return(
    <section className="mb-8 sm:mb-12 bg-white rounded-lg shadow-lg p-4 sm:p-6 md:p-8 border-t-4" style={{ borderTopColor: '#ff37ad' }}>
      <h2 className="text-xl sm:text-2xl font-bold mb-3 sm:mb-4" style={{ color: '#371c5d' }}>วัตถุประสงค์หลัก</h2>
      <p className="text-sm sm:text-base leading-relaxed mb-4 sm:mb-6" style={{ color: '#371c5d' }}>
        การประกวดครั้งนี้มีจุดมุ่งหมายเพื่อสร้างสรรค์ ต้นแบบห้องน้ำสาธารณะคุณภาพสูง ที่สามารถนำไปก่อสร้างหรือติดตั้งในพื้นที่สาธารณะทั่วประเทศไทยได้อย่างหลากหลาย ไม่ว่าจะเป็น สวนสาธารณะ, วนอุทยานฯ, วัด, โรงเรียน หรือหน่วยงานต่างๆ โดยเน้นการออกแบบที่ตอบโจทย์หลัก 5 ประการ ดังนี้:
      </p>

      <div className="space-y-3 sm:space-y-4">
        <ol className="list-decimal pl-4">
          <li>มีดีไซน์ที่สวยงาม มีเอกลักษณ์ มีความพิเศษ ช่วยสร้างสรรค์ภูมิทัศน์ที่สวยงามในแต่ละพื้นที่</li>
          <li>เป็นห้องน้ำที่ถูกสุขอนามัย และใช้งานได้อย่างเหมาะสม สะดวกสบาย สำหรับทุกคน ทุกวัย ทุกข้อจำกัด รวมทั้งมีความปลอดภัย และง่ายต่อการดูแลรักษา</li>
          <li>ออกแบบอาคารที่ คำนึงถึงสิ่งแวดล้อม และสภาพแวดล้อม ของพื้นที่ติดตั้งแบบต่างๆ ในประเทศไทย</li>
          <li>มีการใช้เทคโนโลยีที่ไม่ซับซ้อนเกินไป เพื่อไม่ให้เป็นอุปสรรคต่อเทคนิคการก่อสร้างและงบประมาณในการนำไปสร้างจริง</li>
          <li>เป็นห้องน้ำที่สร้าการใช้เป็นห้องน้ำสาธารณะที่สร้างความสุขให้กับผู้พบเห็นและผู้ใช้งาน อย่างแท้จริง</li>
        </ol>
      </div>
    </section>
  )
}